In [8]:
import pandas as pd
import numpy as np

In [14]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [15]:
type(df.index)

pandas.core.indexes.range.RangeIndex

In [17]:
idx = df['FlightNumber'].index[df['FlightNumber'].isnull()]
total_nan_len = len(idx)

for i in idx:
    df.loc[i, 'FlightNumber'] = 10045 + i*10
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [18]:
df['FlightNumber'].fillna(value={1:10055,3:10075},inplace=True)

In [19]:
def change_to_int(a):
    return(int(a))

In [20]:
df['FlightNumber']=df['FlightNumber'].apply(change_to_int)

In [21]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [22]:
df1 = df.copy()
print(len(df))

5

In [23]:
li=[]
df1['From']=""
df1['To']=''
for i in range(df1.shape[0]):
    li=df['From_To'][i].split('_')
    df1['From'][i]=li[0]
    df1['To'][i]=li[1]

<ipython-input-23-1c89f9209ed1>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['From'][i]=li[0]
<ipython-input-23-1c89f9209ed1>:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['To'][i]=li[1]

In [24]:
df1.drop('From_To',axis=1,inplace=True)

In [26]:
df1

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    LoNDon      paris
1         10055            []    <Air France> (12)    MAdrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3         10075          [13]       12. Air France  Budapest      PaRis
4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

In [28]:
def correct_the_alphabets(str1):
    li=[]
    str2=''
    li.append(str1[0].upper())
    i=1
    for i in range(len(str1)):
        if i!=0:
            li.append(str1[i].lower())
    for i in li:
        str2=str2+i
    return (str2)

In [29]:
df1['From'] = df1['From'].apply(correct_the_alphabets)

In [30]:
df1['To'] = df1['To'].apply(correct_the_alphabets)

In [31]:
df1

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [133]:
print(len(df1['RecentDelays'][2]))

3

In [134]:
delay_len = 0
for i in df1['RecentDelays']:
    #print(len(i))
    if delay_len < len(i):
        delay_len = len(i)   
        
for i in range(delay_len):
    df1['delay_'+str(i)] = 0

In [135]:
for i in range(len(df1['RecentDelays'])):
    #print(i)
    for j in range(len(df1['RecentDelays'][i])):
        #print(i[j])
        df1['delay_'+str(j)][i] = df1['RecentDelays'][i][j]

<ipython-input-135-69ee8272eacc>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['delay_'+str(j)][i] = df1['RecentDelays'][i][j]

In [136]:
df1

,FlightNumber,RecentDelays,Airline,From,To,delay_0,delay_1,delay_2
0,10045,"[23, 47]",KLM(!),London,Paris,23,47,0
1,10055,[],<Air France> (12),Madrid,Milan,0,0,0
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24,43,87
3,10075,[13],12. Air France,Budapest,Paris,13,0,0
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,67,32,0